test/artillery.yml
config:
  target: http://localhost:5000/api/users
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 40
      name: Warm up phase
  processor: "./dataGenerate.js"

scenarios:
  - flow:
      - post:
          url: "/signup"
          beforeRequest: "generateRandomBody"
          json: "{{ data }}"
          capture:
            json: "$.data.user.email"
            as: "email"
      - post:
          url: "/login"
          method: "post"
          json:
            password: "{{ data.password }}"
            email: "{{ email }}"